/**
 * 
 */
package org.adaikiss.kay.trys;

/**
 * @author Administrator
 *
 */
public class NameTry {
	public String NameTry;
	public NameTry(){
		http://www.你不蛋疼谁蛋疼.com
		for(;;)
			for(;;)
				continue http;
	}
	{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}
	{}{}{}{/**/}{}{}{}{}{}{/**/}{}{}{}
	{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}
	{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}
	{}{/**/}{}{}{}{/**/}{}{}{}{/**/}{}
	{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}
	{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}
	{}{}{}{/**/}{}{}{}{}{}{/**/}{}{}{}
	{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}
	{}{}{}{}{}{}{}{/**/}{}{}{}{}{}{}{}
	{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}
	public String NameTry1(){
		this.NameTry = "My eggs hurt";
		return this.NameTry;
	}
}
