http://http://sou.qq.com/online/get_weather.php?city=杭州
{
	"real" : {
		"temperature" : "27"
	},
	"future" : {
		"id" : 255,
		"name" : "杭州",
		"wea_0" : "阵雨",//今天天气
		"bwea_0_icon" : "s_a3.png",//http://cache.soso.com/zdq/wea/s_a3.png
		"tmin_0" : "18",
		"tmax_0" : "23",
		"wea_1" : "阵雨",//明天天气
		"bwea_1_icon" : "s_a3.png",
		"tmin_1" : "18",
		"tmax_1" : "23",
		"wea_2" : "\u9634",//后天天气
		"bwea_2_icon" : "s_a2.png",
		"tmin_2" : "21",
		"tmax_2" : "26",
		"forecast" : [{
				"DATE" : "2013-09-06",
				"BWEA" : "阵雨",//白天天气
				"EWEA" : "阵雨",//夜间天气
				"BWD" : "北风",//白天风向
				"EWD" : "北风",//夜间风向
				"BWS" : "微风",//白天风力
				"EWS" : "微风",//夜间风力
				"TMAX" : "23",//最高气温
				"TMIN" : "18"//最低气温
			}, {
				"DATE" : "2013-09-07",
				"BWEA" : "\u9635\u96e8",
				"EWEA" : "\u9635\u96e8",
				"BWD" : "北风",
				"EWD" : "北风",
				"BWS" : "微风",
				"EWS" : "微风",
				"TMAX" : "23",
				"TMIN" : "18"
			}, {
				"DATE" : "2013-09-08",
				"BWEA" : "\u9634",
				"EWEA" : "\u9634",
				"BWD" : "\u4e1c\u5317\u98ce",
				"EWD" : "\u4e1c\u5317\u98ce",
				"BWS" : "\u5fae\u98ce",
				"EWS" : "\u5fae\u98ce",
				"TMAX" : "26",
				"TMIN" : "21"
			}, {
				"DATE" : "2013-09-09",
				"BWEA" : "\u9634",
				"EWEA" : "\u591a\u4e91",
				"BWD" : "\u4e1c\u5317\u98ce",
				"EWD" : "\u4e1c\u98ce",
				"BWS" : "\u5fae\u98ce",
				"EWS" : "\u5fae\u98ce",
				"TMAX" : "30",
				"TMIN" : "25"
			}, {
				"DATE" : "2013-09-10",
				"BWEA" : "阵雨",
				"EWEA" : "多云",
				"BWD" : "东风",
				"EWD" : "东北风",
				"BWS" : "微风",
				"EWS" : "微风",
				"TMAX" : "30",
				"TMIN" : "25"
			}
		],
		"zhishu" : {
			"FORECASTDATE" : "2013-09-06",
			"CT" : "建议着薄型套装等春秋过渡装。年老体弱者宜着套装。但昼夜温差较大，注意适当增减衣服。",
			"CT_N" : "舒适",//穿衣指数
			"CO" : "温度适宜，风力不大，您在这样的天气条件下，会感到比较清爽和舒适。",
			"CO_N" : "舒适",//舒适度指数
			"CL" : "天气不错，空气清新，是您晨练的大好时机，建议不同年龄段的人们积极参加户外健身活动。",
			"CL_N" : "舒适",//晨练指数
			"GM" : "昼夜温差较大，较易发生感冒，请适当增减衣服。体质较弱的朋友请注意防护。",
			"GM_N" : "较易发",//感冒指数
			"AC" : "您将感到很舒适，一般不需要开启空调。",
			"AC_N" : "较少开启",//空调指数
			"XC" : "不宜洗车，未来24小时内有雨，如果在此期间洗车，雨水和路上的泥水可能会再次弄脏您的爱车。",
			"XC_N" : "不宜",//洗车指数
			"YS" : "天气较好，因此您可放心出门，无须带雨伞。",
			"YS_N" : "不带伞",//雨伞指数
			"PL" : "气象条件对空气污染物稀释、扩散和清除无明显影响，易感人群应适当减少室外活动时间。",
			"PL_N" : "中",//空气污染指数
			"PJ" : "适量的饮用啤酒可能会更增加您舒适的感觉，但要注意千万不要过量呦。",
			"PJ_N" : "较适宜",//啤酒指数
			"LS" : "天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！",
			"LS_N" : "适宜",//晾晒指数
			"TR" : "天气较好，但丝毫不会影响您出行的心情。温度适宜又有微风相伴，很适宜旅游。",
			"TR_N" : "很适宜",//旅游指数
			"GJ" : "天气较好，在这种天气里去逛街，既可畅快地放松身心，又会有很多意外收获，真是无比惬意。",
			"GJ_N" : "适宜",//逛街指数
			"UV" : "紫外线强度较弱，建议出门前涂擦SPF在12-15之间、PA+的防晒护肤品。",
			"UV_N" : "弱",//紫外线指数
			"ZS" : "温度不高，其他各项气象条件适宜，中暑机率极低。",
			"ZS_N" : "无",//中暑指数
			"BP" : "无",
			"BP_N" : "无"
		}
	}
}
