/**
 * 
 */
package org.adaikiss.kay.trys.tools;

/**
 * @author hlw
 *
 */
public class GetXMLContentTry {

	/**
	 * @param args
	 */
	public static void main(String[] args) {
		String xml = "<content><id/><bookid/><contents><![CDATA[<?xml version=\"1.0\" encoding=\"UTF-8\"?>" + 
"<html><head><title>第一章 初遇芳华</title><meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\" /><meta content=\"MSHTML 8.00.6001.18783\" name=\"GENERATOR\" /></head><body style=\"FONT-SIZE: 16px\"><p>　　老乞丐直到死前还一直坚信我不是孤儿，他说那时候庙还没这么破，而我似乎穿得很好，一身行头像是有钱人家的小孩。</p><p>　　他告诉我，我还有娘，说她以后会回来接我。</p><p>　　一间庙，一间破庙，一间没有香火、没人供奉的破庙。</p><p>　　庙里光线昏昏沉沉的，四周残破不堪。庙堂中间一尊大佛满身灰尘，佛身虽然破损却依然不失尊严。这个破庙是挡不住风雨的，却仍有流离失所的人将它当做唯一的藏身场所。</p><p>　　庙里没有燃篝火，有些清冷。</p><p>　　几个穿着破烂、乞丐模样的人搂抱着枯草蜷缩在一旁。身强力壮的乞儿已经把干燥朝阳的、位置比较好的地方给占了。</p><p>　　我用袖子擦了擦脸，啐了一口。我朝四周望了一下，解着裤腰带蹲在庙前的林子里，装成上茅厕的样子，却趁旁人不注意，偷偷在土里刨着……</p><p>　　这个时候做这件事，必然要冒很大的风险，动作也要快、精、准，且迅速。</p><p>　　一袭长且旧的袍子穿在我的身上一点儿也不合身。我知道现在这一身打扮很滑稽——这套灰青布袍子还是从一个死人身上扒下来的。</p><p>　　我不知道自己叫什么名字。</p><p>　　庙里的老乞丐说，我是被我娘在一个风雪交加的日子送来的，那是一个眼角有泪痣的女人，芳华绝代，美得不似凡人。每当这个时候，那又老又臭的叫花子就会睁着混浊的眼望着我，然后一脸失望地摇了摇头。我知道他又会说，你连你娘亲的十分之一都不及。</p><p>　　呸！</p><p>　　这个老乞丐，临死了都还这么色。</p><p>　　话虽这么说，他却是这破庙里唯一护着我的人。他在最饿的时候也不忘分一口羹给我这小叫花子。</p><p>　　“兵荒马乱的年代，终究是要妻离子散，饿殍浮尸。”这是老人死前留下的最后一句话，也是我觉得最有学问的一句话，因为我一个字都没听懂。</p><p>　　可作为一个小乞丐不需要内涵与修养，字认得再多也找不来吃的。我好死赖活地在这块破土地上待了五年，没被饿死也算是个奇迹了。一场大病把我烧糊涂了……我不知道自己究竟有多大。上下瞅一瞅，瞧自己这身形约莫也就七八岁，看上去还是个孩子，但我想自己应该不止这个岁数，因为我懂得很多事情，或许我只是发育不良。</p><p>　　老乞丐直到死前还一直坚信我不是孤儿。他说那时候庙还没这么破，而我似乎穿得很好，一身行头像是有钱人家的小孩。</p><p>　　他告诉我，我还有娘，说她以后会回来接我。</p><p>　　但我对他说的一切全然没有了印象……</p><p>　　这老乞丐曾经是个说书的，谁知道他整日与我唠叨的这一切是不是在胡诌呢？</p><p>　　这是个逼不得已也会出现人吃人的世道，而我要做的就是怎么好好活下去……</p><p>　　如今现实摆在我的眼前，破庙里唯一待我好的人死了。我的前途一片堪忧，但好在老乞儿死前还给我留了些吃的。</p><p>　　长袍拖在地上沾染了灰尘，我的手早已脏兮兮了，指甲里满是灰土，但我依旧很高兴，因为我知道只要将潮湿的土刨开，便能找到一个油纸包，里面还有半个馒头。</p><p>　　这年头吃食很少了，观音土都有人吃……</p><p>　　偷、藏、抢是必不可少的求生技能，也只有这样才能在这一遭乱世里存活。</p><p>　　我贼头贼脑的，花了一两秒的时间，打开油纸包，偷偷地咬了一口老面馒头，含在嘴里，不舍得嚼。我手指发抖地把吃食拿纸裹好，又依依不舍地闻了一闻那味儿，小心翼翼地把它放回了土里，扒来几把土，又把它给埋了，末了顺手就抓了一把观音土，塞进嘴里……嚼了嚼，忍不住皱着眉头，味道有些不大好，能饱肚子就行。</p><p>　　“你个臭小子，偷偷摸摸地在吃什么，也不孝敬爷们。”</p><p>　　我一惊，立马在地上抚了几把，一阵狗刨式，极力想把挖乱的痕迹给遮掩住了。</p><p>　　“看这样子，定是那老乞丐给他留了什么好吃的。”突然一股力道袭来，谁的脚猛地踹在了我的背上。我身子往前一趴，背上火辣辣地疼，憋得我眼泪都出来了……喉咙一哽，一嘴和着馒头的泥还来不及入肚，便喷涌而出……</p><p>　　白白的观音土，夹着白且糯的老面馒头。</p><p>　　真可惜！</p><p>　　“靠！他有馒头。”</p><p>　　话音刚落，几只脏兮兮的手便一阵乱摸，竟掏出了地里的纸包。</p><p>　　“有些馊了。”</p><p>　　“还能吃，给我留一点儿。”</p><p>　　“他奶奶的……死贱种，居然学会了自个儿偷着吃，看我不踹死你个贼小子。”</p><p>　　拳头似雨点一般，落在我身上。</p><p>　　我的五脏六腑都在疼……灼烧一般，这感觉竟比几日没东西吃时的胃绞痛还要来得剧烈。</p><p>　　横竖都是死……</p><p>　　“几个老要饭的欺负我一个，娘的，我跟你拼了！”我趴在一个人身上，抱着他的腿，在那臭熏熏的裤管上狠狠地咬……</p><p>　　“疼死我了，狗娘养的。”</p><p>　　那拳头像一阵狂风暴雨般袭来，一时之间，尘土扬起，我被迷了眼。我那残破不堪的小身板一点点往前挪，手指发颤地向前伸。在一阵抢夺中，我拾起跌落在地上的馒头，一把塞入嘴里咬了一口，大口地嚼着……潮湿的土混着腥味，又是个馊馒头，真是憋屈。</p><p>　　我眼里满是湿气。</p><p>　　这叫啥……</p><p>　　死也不能做个饿死鬼！</p><p>　　这几个壮汉乞丐被我这英雄之举给气得不轻，一个个竟杵在那儿，只知道拽着我衣袍的后领子一个劲儿地晃。就算快被晃死了我也坚决不吐。馒头虽馊，到底也是个馒头啊！稀罕物！</p><p>　　正当我闭着眼，准备接受再一轮的蹂躏时，周围突然静悄悄的，气氛诡异得令人心生不安。</p><p>　　我躬了躬身子，匍匐着向前，探手去抓那馊馒头准备又咬一口时，一双白得不该出现在这破庙里的上等靴子便呈现在了我眼皮底下。那双靴子很精准地踩在了我唯一的口粮上面，这叫一个白……比我那馒头还要雪白。</p><p>　　我傻了眼。</p><p>　　一袭月牙白的袍子慢慢地垂在了地上，衣裳的质地也不知道是什么，总之很上等。</p><p>　　那人不知道扔了一个什么东西出去，那些揍我的乞丐们便一哄而散，群起抢之。</p><p>　　我还是死死地趴在地上，一动也不动地护着那个馊馒头。</p><p>　　“这玩意儿还能吃？”琅琅如玉的声音却有着绵绵之力，温雅的语调，仿若清泉凉水注入我的全身，连带着身体似乎也不那么疼了。</p><p>　　“不吃就会饿死。”</p><p>　　“愿意随我一同回家么，管你一日三餐，保你吃饱。”</p><p>　　一只玉手修长而秀美，像是怕弄疼我似的轻轻将我扶起。我诧异地抬头看向那个人，事隔多年我都无法完整地阐述初见他时那惊心动魄的美。</p><p>　　那一年，是我在破庙里待的第五季早春。</p><p>　　我，初遇芳华。</p><p>　　他的手很温暖。</p><p>　　“愿意随我一同回家么，管你一日三餐，保你吃饱。”男人与生俱来的倾醉轻语，明显地带着诱拐的口吻。</p><p>　　从来就只有人骂我臭乞儿，却没有一个人这么牵过我。</p><p>　　于是小小不懂事的我沦陷在一己口腹与他的美色中，为了区区一个温饱，点了点头，任由他牵着，乖顺地扮着小腼腆的样子，内心却如一江春水澎湃不息。</p><p>　　大街上比较清冷，偶尔有两三个衣衫褴褛的人气息微弱，半合着眼，倚在石阶上。有一个小乞儿披着一身麻布褂子，伸着手挡在他面前。</p><p>　　哟……干吗？不会是想拦路打劫吧？</p><p>　　我仰着脑袋，掀起眼皮看了一眼美人。</p><p>　　他像是没了兴趣，不闻不问的。</p><p>　　这孩子虽然脸蛋脏兮兮，但那股机灵劲儿没法说了。他一双黝黑的眼睛直往我们相牵的手上瞅，还一路小跑着跟上来，甚至试着用手来拉，却被美人挥着袖子推开了。</p><p>　　我以为他脾气很好，结果，似乎不是……</p><p>　　“记住，我不喜欢与人接触。”</p><p>　　枝上柳绵狂飞，徐徐的风吹鼓着他的袖袍，阳光下他的那张脸美得让人看不大真切，似乎有淡淡的皎洁的光在他周身笼罩着。他一脸的清淡表情，竟用这种柔软的表情说这么病态的话，更何况他的手以一种执著的意味拎着我的手。</p><p>　　我沉默了。</p><p>　　他亦不多言，就这么一声不吭地带我穿过俗香扑鼻的花巷，直往那人烟荒芜的偏僻林子深处而去。</p><p>　　我惧怕了，抽出手就想跑，却被美人拉得更紧了。</p><p>　　听说，有些人就喜欢拐小叫花子做娈童，还往那偏僻地方带。</p><p>　　听说，穷人没东西吃，可有些富人平常的东西吃腻烦了，就喜欢把五六岁的小孩洗干净，清蒸了吃，当然……这也得往偏僻地方去。</p><p>　　我一路跟着，腿抖得慌，身子虚得很。也不知道走了多久，在我跟不上他的步子几欲摔倒时，他旋身轻轻地将我搂抱起来。我这叫一个受宠若惊，整个人呆住了。</p><p>　　“别乱动。”</p><p>　　美人的身上有股异香让人安心，闻着这香我感到有些疲惫，那温软的语调继续在我耳边响起：“家，快到了。”</p><p>　　他后面还说了什么，似乎很重要。</p><p>　　我却什么也听不清了，倦意像潮水一般袭来，我靠在他暖暖的怀里沉沉睡去。</p><p>　　我做了一个梦。</p><p>　　在最寒冷、最饥饿交迫的日子，老乞丐抱着我说：命苦的孩子，你本该大福大贵的，忍着咬牙挺过来……你的娘会来接你。</p><p>　　这个梦做了多久我并不知情，再睁开眼时发现自己已经躺在了一张木雕的床上。房梁似乎在晃……不，是床在晃。温软的被褥，就像是某人的怀抱，一股子异香袭来，浑身都有这种说不出的畅快，很熟悉的感觉。</p><p>　　我琢磨琢磨……</p><p>　　热乎乎的气息拂上了脖颈，一时缓一时急，却又绵绵不断，痒得没法说了。我一翻身正巧跌入一个人的怀里，那脸便映入我眼前，着实吓了我一大跳。</p><p>　　美人如玉兮隔云端，近看兮……</p><p>　　一双丹凤眼便似美玉，澄亮清澈，眼尾略弯，左眼下方一粒精致的朱砂点缀在白皙的肌肤上，仿若皑皑白雪中的冷梅，红得让人有种惊心动魄的美。</p><p>　　我的小心肝一阵乱跳。</p><p>　　没来由的……我就怔怔地望着他发呆了。我活了这小半辈子，从没有见过这么美的人，看一次，入迷一次。</p><p>　　“醒了吗？”他的声音如清泉般温柔清脆，有些低沉但煞是好听。</p><p>　　“嗯。”我恍惚出神，从没有这么近距离看过他，如今再一瞧，真有些分辨不出他究竟是男是女。</p><p>　　老乞丐说，我娘的眼下有一颗泪痣，终有一天，她会回来接我。</p><p>　　望着他的一张脸，我又乐得呆傻了。</p><p>　　“屋后面有清泉，换洗的衣服在床头，你净身后就来前庭吃饭。”他直起身子，撑着手从床上下来，走到门前顿了一顿，“你身上那股什么味儿，不洗干净就别进家门。”</p><p>　　我呆呆地看着他离去的身影，那身白衣飘逸脱俗，身形纤秀却有些仙风道骨的味道。</p><p>　　我垂下头，小心肝儿颤着呢。</p><p>　　乖乖……莫不是遇到了神仙？</p><p>　　说来也怪，为什么在这么多人中他偏偏选了我？难道他生了一副菩萨心肠，看不得一群大人欺负一个小孩？可他分明对街上饿得奄奄一息的乞丐不闻不问，也没见他施舍半个子儿。</p><p>　　难道……他真想养娈童或是吃小孩？</p><p>　　可是在路上拦着他的那个小乞丐更机灵，五官也比我更好看，还是自己送上门的，没道理……选我……不选他啊。</p><p>　　我一脸狐疑，换洗之后打量着镜子里的自己，一个瘦弱的发育不良的身子裹在略微偏大的衣袍里，一张脸无论怎么洗还是有些脏，头发像草一样枯且黄，怎么看都像个毛头小子。也难怪他会给我一个男式的袍子，不过无论怎么样……有新衣裳了，我知足了……</p><p>　　到了前庭，美人已经坐着等我了。一碗白花花的米饭，一碟青葱白豆腐，一大碗红烧肉摆在我面前。</p><p>　　“吃吧。”他抬手指指桌上的菜。</p><p>　　肉……</p><p>　　我也顾不得其他，夹着箸横扫了过来，右手抖簌簌地做着扒的姿势，狼吞虎咽却也含糊地说：“你……不吃吗？”</p><p>　　他只是笑望着我，并不动箸。</p><p>　　“当真不吃？”我疑问道。</p><p>　　“我不习惯吃这些。”他说完便起身接了一盆清水，将手泡在里面好久，然后徐徐离去。</p><p>　　奇怪的人。</p><p>　　哪有人吃不惯饭的，难道这些都是……特意做来给我吃的？</p><p>　　我笑眯了眼，看来住在这儿也不坏。</p><p>　　仙人都像这个美人一样不食人间烟火的吗？</p><p>　　我抱着这个疑问过了整整三天，直想拿拳头砸胸，太憋闷了。</p><p>　　这几日美人都是看着我吃饭，然后就束手出去，过了大半会儿才一脸心满意足地回了宅子，然后一整个下午就躺在竹席上假寐。他不给我安排活儿做，也很少与我说话，像是彻头彻尾地忘了还有我这么一个人存在，哪怕我为了提高知名度经常在他面前晃来晃去，他也不正眼瞧我一下。虽然他在精神上这么虐待我，却每日按时做好了三餐，伺候得我舒舒服服的。就好像我不是被他领来使唤的，而是原本就是让我来享福的。他真是诡异的一个人……</p><p>　　晌午。</p><p>　　他照例又做了一些汤菜，摆在桌上，筷子也不动一下，直接无视我，撩起袍子出门了。我紧张地扒了几口饭，用袖子一擦嘴，猫着身子，屏住呼吸，小贼似的尾随其后。</p><p>　　他这宅子建得很偏僻。宅子周围没有邻里，宅子后面种着一片草药。</p><p>　　一袭白色的身影隐没在古树林里。绿树阴浓夏日长，一池春水泛碧波，也让人感到无限的凉意。</p><p>　　咦……奇怪了，这个人怎么一声不响地溜到这个鸟不拉屎的地方了。</p><p>　　顶着炎炎烈日，我一路小跑。</p><p>　　我趴在一株古树后头，悄然探头望去。乖乖……</p><p>　　我看到那美人腾空一跃，碧池上倒映着身影，白袍翩跹。美人的足尖在池面上轻轻一点，涟漪都没泛一个。只见他玉手一探，我还没瞧个清楚，他便身形一晃又缓缓落到了地上，那身姿美得仿若仙子，只是手上多了一株莲花。</p><p>　　啊……看不出来，他这么有情调。</p><p>　　大热天的，他飘着轻功到池面上采莲，够有情调的啊。</p><p>　　我正欲抒发内心的澎湃时，美人如画，长发纷飞，缤纷落英。</p><p>　　他动作极美地将一片片水灵灵的莲瓣扯了下来——请记住，他是用扯的——然后拈起来，放入嘴里含着，嚼了起来。</p><p>　　他这表情……似乎是正在品尝人间美味。</p><p>　　我忙死死地趴在古树上，睁大了眼睛，看着这神仙似的人飞上飞下。一瞬间的工夫，他采撷了许多不知名的花，手一拧，斜躺在树杈上，全数塞入了嘴里。</p><p>　　看完他这行云流水般的动作后，我完全地呆若木鸡了。</p><p>　　他的吃相很雅致，微抿着的唇型，弧度有些张扬却很性感。</p><p>　　倘若他吃的是五谷杂粮，我会觉得此时的他会更迷人。</p><p>　　哪有好好的饭菜不吃，偏吃这种人不吃的……</p><p>　　等等！</p><p>　　俗话说，很多世外高人都不按常理出牌。他武功这么高……一定和他吃的食物有关系，莫非这些花能提升内力？</p><p>　　对！一定错不了！</p><p>　　于是，我一脸的贪馋模样，跑到他的树下，蹲着，仰头，只差没摇尾巴了。</p><p>　　他低头望着我，也不动声色，那眼神却分明在说，你怎么跑来了。</p><p>　　我装傻充愣。</p><p>　　他偏头，嚼了嚼。</p><p>　　我直勾勾地盯着，激动又崇拜地望着他。</p><p>　　“……要吃吗？”终于，他开了口。</p><p>　　我眼睛一亮，忙不迭地点头。</p><p>　　他真的好大方，我这手还没伸出来，他就给了我一大把。</p><p>　　我低头闻着。</p><p>　　香……可是闻不出什么特别的。</p><p>　　这年头没东西吃，树皮我都啃过……可是花我却是不吃的，因为分不清有毒和没毒的，重要的是口感不好。</p><p>　　这个……或许，不一样。</p><p>　　我学着他的样子，一把塞进嘴里，狠狠地嚼了一下。</p><p>　　一时之间苦不堪言。</p><p>　　这些花又苦又涩，难吃极了，唯有一股花香在唇舌间蔓延。</p><p>　　这根本就是很寻常的花么，他这不整人嘛……啐……舌根都是麻的……</p><p>　　他的眼笑得弯弯的。</p><p>　　我怒，这也太欺负人。</p><p>　　“好吃吗？”</p><p>　　“他妈的，这压根儿就不是人吃的。”</p><p>　　“没错。”他一手徐徐地撑着头，半躺在树上望着我，那姿势颇有些居高临下的意味。水杏凤眼，一粒泪痣，别有一种说不出的风韵，“这不是人吃的。”</p><p>　　那他吃……</p><p>　　岂不是，他自己骂自己了？</p><p>　　他似乎是在阐述一种事实。总之，说不上来，他一本正经的样子，脸上也没有什么情绪。</p><p>　　他倾身望了我一会儿，倏地一下跳下了树，溅落了一地的残花红杏。</p><p>　　他的表情冷冷的。</p><p>　　啊……</p><p>　　大爷，您不是就生气了吧？</p><p>　　我的长期饭票啊，白花花的米饭岂能看着它就这样溜走了……</p><p>　　我想到如果得罪了他，或许以后又要回去过那生不如死、饥饿难耐的日子。</p><p>　　于是我恶从胆边生。</p><p>　　我撩起袍子，疾步追上前去，一把就从后面搂住了他。</p><p>　　很温软，又很香……这感觉，就像是每夜温习了很多次、回味了许久的滋味，于是我喊出了让我们二人日后回忆起来都抖个不停的一声：“娘……”</p><p>　　他身子一抖，像是被我吓着了，想拉开我。</p><p>　　我愣住了，知道闯祸了。</p><p>　　唉，真丢人啊。</p><p>　　于是，我索性小胳膊用力，把他搂得更紧了。</p><p>　　他像是被我弄得有些手足无措，无奈又挣不脱，随即只好轻轻地拍着我，等我抽噎着平静了才拉远我。他单膝跪在地上捧着我的脸与我平视，眼中带着点儿无奈、恼怒与一丝心疼：“听着，你可以把这里当成家，但我不是你的娘……而且……”他的声音低沉，似乎还夹杂着一些努力不让人察觉的什么东西，“而且我是男子，我和你们世人不一样。我是兽，你可以叫我芳华，不要叫我娘。”</p><p>　　我眨了眨眼睛，仰着头看着他，一瞬间观察到他眉间极力掩藏的忧伤。</p><p>　　可惜当时，我却懂得太少。</p><p>　　“义父。”我趴在他腿旁，怯生生地唤他。</p><p>　　他瞪我，攀亲也不让我攀……</p><p>　　许多年后我都很后悔，因为在那之后，我喊了他一声：“师父。”</p></body></html>]]></contents><createtime>2010-07-06 13:26:35</createtime><wordcount/></content>";
		char[] chars = xml.toCharArray();

		int beginIndex = -1;
		int endIndex = -1;
		for(int i = 0;i< chars.length; i ++){
			if(chars[i] == '<'){
				if(chars[i + 1] == 'b' || chars[i + 2] == 'B'){
					if(chars[i + 2] == 'o' || chars[i + 2] == 'O'){
						if(chars[i + 3] == 'd' || chars[i + 2] == 'D'){
							if(chars[i + 4] == 'y' || chars[i + 2] == 'Y'){
								for(int j = i + 4; j < chars.length; j ++){
									if(chars[j] == '>'){
										beginIndex = j + 1;
										break;
									}
								}
								i = i + 4;
							}
							i = i + 3;
						}
						i = i + 2;
					}
					i = i + 1;
				}
			}
		}
		if(beginIndex == -1){
			return;//"";
		}
		for(int i = beginIndex;i< chars.length; i ++){
			if(chars[i] == '<'){
				if(chars[i + 1] == '/'){
					if(chars[i + 2] == 'b' || chars[i + 2] == 'B'){
						if(chars[i + 3] == 'o' || chars[i + 3] == 'O'){
							if(chars[i + 4] == 'd' || chars[i + 4] == 'D'){
								if(chars[i + 5] == 'y' || chars[i + 5] == 'Y'){
									if(chars[i + 6] == '>'){
										endIndex = i - 1;
										break;
									}
									i = i + 6;
								}
								i = i + 5;
							}
							i = i + 4;
						}
						i = i + 3;
					}
					i = i + 2;
				}
				i = i + 1;
			}
		}
		if(endIndex == -1){
			return;//"";
		}
		String content = xml.substring(beginIndex, endIndex + 1);
		System.out.println(content);
	}

}
